import org.telegram.telegrambots.meta.api.objects.Message;
import org.telegram.telegrambots.meta.api.objects.Update;

/*public class Work {
    public int regester(Update update, int j) {           // j - сюди ви маєте помістити на яке повідомлення буде реагувати кожне наступне повідомлення, тобтопо якій "стежці" має піти, якщо не поняли напишіть в бесіду
        Main main = new Main();                           //  хтось має створити під це клавіатуру!!! ето важно
        Message message = update.getMessage();
        if (message != null && message.hasText()) {
            switch (j) {
                case "1":
                    //Я хочу поміняти категорії щоденних повідомлень
                    //Ви маєте стврорити відповідний клас, якому будете передавати "Message". в класі ви маєте опреділит кожну кнопку, шо робити в кожному з випадків(так як і в мене) P.S. називайте клами і методи відповідно до фенкціоналу хоч приблизно
                case "2":
                    //Я хоті поміняти мову
                case "3":
                    //Я хочу поміняти час повідомлень
                case "4":
                    //Я хочу поміняти кількість повідомлень
                case "5":
                    //Я хочу побачити зараз повідомлення моїх категорій
                case "6":
                    //Я хочу перезареєструватись
                case "7":
                    //я хочу бачити новини певних категорій() певних днів і годин
            }
        }
    }
}*/



//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! я закометував бо код покіщо видає помилку (кейси не заповнені діями)!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1